In [7]:
import pandas as pd
csData = pd.read_csv("C:/Users/SMART-25/stddev/dataset/kopo_customerdata.csv")
csData

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299995,465757,State1,1,Male,0,1,0,0,40600,0,40600,0,0,0,1,0
299996,1890264,State1,1,Male,0,1,0,1,48000,48000,0,0,0,0,1,0
299997,1857537,State1,1,Female,0,2,0,0,32300,0,0,32300,0,0,1,0
299998,2209324,State1,1,Male,0,1,0,1,48500,0,48500,0,0,0,1,0
299999,1875146,State1,1,Male,0,1,0,1,16500,0,0,16500,0,0,1,0

In [9]:
amountList = csData.TOTAL_AMOUNT.tolist()

In [10]:
amountList.sort()

### step1: 데이터를 정렬한다.(오름차순)
### step2: 최소값 최대값을 계산한다.
### step3: 최소값 최대값 각각의 개수를 산출한다.
### step4: 평균계산: 초기리스트합 - (최소값*최소값개수) - (최대값*최대값개수)
###        / 초기리스트개수 - (최소값개수) - (최대값개수)

In [14]:
minValue = min(amountList)
maxValue = max(amountList)

In [15]:
"minValue: {}/n maxValue: {}/n minValuecnt: {}/n maxValuecnt: {}/n"

'minValue: {}/n maxValue: {}/n minValuecnt: {}/n maxValuecnt: {}/n'

In [16]:
minValuecnt = amountList.count(minValue)
maxValuecnt = amountList.count(maxValue)

In [18]:
finalSum = sum(amountList) - (minValue*minValuecnt) - (maxValue*maxValuecnt)
finalSum

10565615500

In [ ]:
finalavg = finalSum /

In [ ]:
answer = sum(amountList) - (minValue*minValuecnt) - (maxValue * maxValuecnt) / \
         (len(amountList) - minValuecnt - maxValuecnt)

### 튜플

In [ ]:
priceList = [100,200,400,500]

In [ ]:
priceTuple = (100,200,400,500)

In [21]:
priceSet1 = {100,150,200,170}
priceSet2 = {100,139,210,170}
priceSet1.difference(priceSet2)

{150, 200}

In [25]:
allWeek = {1,2,3,4,5,6}
existWeek = {1,2,3,5,6}
print(allWeek.difference(existWeek))
print(allWeek - existWeek)

{4}
{4}

### 딕셔너리

In [43]:
priceList = [10,20,30,40]

In [44]:
priceDict = {"price":priceList}

In [45]:
priceDict["price"]

[10, 20, 30, 40]

In [50]:
pd.DataFrame(priceDict)

   price
0     10
1     20
2     30
3     40

In [46]:
yearweekList = [2021,2020,1998,1988]

In [47]:
valueDict = {"price" : priceList,
            "yearweek" : yearweekList }

In [48]:
valueDict["regionid"] = ["a01","a01","a01","a01"]

In [49]:
print(valueDict)

{'price': [10, 20, 30, 40], 'yearweek': [2021, 2020, 1998, 1988], 'regionid': ['a01', 'a01', 'a01', 'a01']}

In [51]:
pd.DataFrame(valueDict)

   price  yearweek regionid
0     10      2021      a01
1     20      2020      a01
2     30      1998      a01
3     40      1988      a01

In [36]:
import pandas as pd

In [37]:
pd.DataFrame(priceList)

    0
0  10
1  20
2  30
3  40

dic = {"name":"sec","id":"300000","address":"suwon"}
에서 “id”:”300000” 삭제하여 출력하세요
{'name': 'sec', 'address': 'suwon’}

In [32]:
dic = {"name":"sec","id":"300000","address":"suwon"}
# dic이라는 딕셔너리를 생성하였다
dic.pop("id")
# 딕셔너리에서 id라는 키값을 삭제하여 요소를 제거한다.
print(dic)
# id키값을 가진 요소를 제거 후 출력하였다.

{'name': 'sec', 'address': 'suwon'}